app/views/courts/show.html.erb

SELECT "bookings".* FROM "bookings" WHERE ("bookings".court_id = 1)
---
<h2>Bookings</h2>
<% @court.bookings.each do |booking| %>