app/controllers/bookings_controller.rb

SELECT "courts".* FROM "courts" WHERE "courts"."id" = 1 LIMIT 1
INSERT INTO "bookings" ("from", "booker", "updated_at", "court_id", "until", "created_at") VALUES (NULL, 'jlkjljkl;jkjkl', '2011-06-22 10:08:19.713870', 1, NULL, '2011-06-22 10:08:19.713870')
---
def create
    @court = Court.find(params[:court_id])

  @booking.from = Date.civil(params[:from][:year].to_i, params[:from][:month].to_i, params[:from][:day].to_i)
  @booking.until = Date.civil(params[:until][:year].to_i, params[:until][:month].to_i, params[:until][:day].to_i)
@booking = @court.bookings.create(params[:booking])